Revit 2024 API
FamilyManager.MakeReporting Method
Set the family parameter as a reporting parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public void MakeReporting(
	FamilyParameter familyParameter
)
Visual Basic
Public Sub MakeReporting ( _
	familyParameter As FamilyParameter _
)
Visual C++
public:
void MakeReporting(
	FamilyParameter^ familyParameter
)
Parameters
familyParameter
Type: Autodesk.Revit.DB.FamilyParameter
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  Thrown when the input argument-"familyParameter"-is null.
Autodesk.Revit.Exceptions.InvalidOperationException |  Thrown when the parameter can not be changed to a reporting parameter.
See Also
FamilyManager Class
Autodesk.Revit.DB Namespace